Conf.Simple/src/InformationRegisters/SUI_ЛогированиеHTTPЗапросов/SUI_ЛогированиеHTTPЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ЛогированиеHTTPЗапросов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КодСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БазовыйURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтносительныйURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДанныеЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеОтвета</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОтветЕстьДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтветЖдать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтветКоманда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтветНетДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>SID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Метод</name>
    <type>
      <types>EnumRef.SUI_HTTPМетоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/CommonModules/SUI_ЛогированиеHTTPЗапросовВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Функция УстановитьХранениеЛогов(КоличествоДней) Экспорт
	
	ПараметрКоличествоДней = ОбщегоНазначения.ОписаниеТипаЧисло(2, , ДопустимыйЗнак.Неотрицательный).ПривестиЗначение(КоличествоДней);
	Константы.SUI_ХранениеЛоговHTTPЗапросовВДнях.Установить(ПараметрКоличествоДней);
	Возврат ПараметрКоличествоДней;
	
КонецФункции

Процедура ИспользованиеЛогирования(Знач Используется) Экспорт
	
	Используется = SUI_ОбщегоНазначенияКлиентСервер.ОписаниеТипаБулево().ПривестиЗначение(Используется);
	
	Константы.SUI_ЛогированиеHTTPЗапросов.Установить(Используется);
	
КонецПроцедуры

Функция ВыгрузитьЛогированиеHTTPЗапросовВФайл(ПараметрыВыгрузки) Экспорт
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_ЛогированиеHTTPЗапросов.ВыгрузитьЛогированиеHTTPЗапросовВФайл", 
		ПараметрыВыгрузки, ДлительныеОперации.ПараметрыВыполненияВФоне());
	
КонецФункции

Функция HTTPМетодПоСтроке(HTTPМетодСтрокой) Экспорт
	Возврат SUI_ОбщегоНазначенияПереопределяемый.ПредопределенныйЭлемент("Перечисление.SUI_HTTPМетоды." + HTTPМетодСтрокой);
КонецФункции

Функция ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	Возврат SUI_ОбщегоНазначения.ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ);
КонецФункции

Функция ЛогированиеДоступно(ОтносительныйАдрес) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("SUI_ЛогированиеHTTPЗапросов") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("SUI_ОнлайнОбмен") Тогда
		
		// Проверить относительный URL
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ЗаписатьСообщениеЛогирования(СообщениеЛогирования) Экспорт
	
	Запись = РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.СоздатьМенеджерЗаписи();
		
	Запись.Период = ТекущаяДатаСеанса();
	Запись.SID = Строка(Новый УникальныйИдентификатор());
	ЗаполнитьЗначенияСвойств(Запись, СообщениеЛогирования);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись.МеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Запись.НомерСеанса = НомерСеансаИнформационнойБазы();
	Запись.ИмяПользователя = ИмяПользователя();
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Запись.ИдентификаторПользователя = Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ТекущийПользователь, "ИдентификаторПользователяИБ"));
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Запись.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
